{
  "architectures": [
    "Siglip2Model"
  ],
  "initializer_factor": 1.0,
  "model_type": "siglip2",
  "text_config": {
    "model_type": "siglip2_text_model",
    "vocab_size": 256000
  },
  "torch_dtype": "float32",
  "transformers_version": "4.49.0.dev0",
  "vision_config": {
    "model_type": "siglip2_vision_model"
  }
}
